Xanglu/DIY-Sim-Racing-FFB-Pedal-Odrive/ESP32/src/Main.cpp
#include "SignalFilter.h"
KalmanFilter* kalman = NULL;
KalmanFilter* kalman_joystick = NULL;

#include "SignalFilter_2nd_order.h"
KalmanFilter_2nd_order* kalman_2nd_order = NULL;




/**********************************************************************************************/
/*                                                                                            */
/*                         loadcell definitions                                               */
/*                                                                                            */
/**********************************************************************************************/

#ifdef USES_ADS1220
  /*  Uses ADS1220 */
  #include "LoadCell_ads1220.h"
  LoadCell_ADS1220* loadcell = NULL;

#else
  /*  Uses ADS1256 */
  #include "LoadCell.h"
  LoadCell_ADS1256* loadcell = NULL;
#endif


/**********************************************************************************************/
/*                                                                                            */
/*                         stepper motor definitions                                          */
/*                                                                                            */
/**********************************************************************************************/

#include "StepperWithLimits.h"
StepperWithLimits* stepper = NULL;
//static const int32_t MIN_STEPS = 5;

#include "StepperMovementStrategy.h"

bool moveSlowlyToPosition_b = false;
/**********************************************************************************************/
/*                                                                                            */
/*                         OTA                                                                */
/*                                                                                            */
/**********************************************************************************************/
//OTA update
#ifdef OTA_update
//#include "ota.h"
#include "OTA_Pull.h"
TaskHandle_t Task4;
char* APhost;
#endif
#ifdef OTA_update_ESP32
  #include "ota.h"
  //#include "OTA_Pull.h"
  TaskHandle_t Task4;
  char* APhost;
#endif

#if !defined(OTA_update) && !defined(OTA_update_ESP32)
  #include "ota.h"
#endif


//ESPNOW
#ifdef ESPNOW_Enable
  #include "ESPNOW_lib.h"
  TaskHandle_t Task6;
#endif

#ifdef USING_LED
  #include "soc/soc_caps.h"
  #include <Adafruit_NeoPixel.h>
  #define LEDS_COUNT 1
  #ifdef LED_ENABLE_RGB
    Adafruit_NeoPixel pixels(LEDS_COUNT, LED_GPIO, NEO_RGB + NEO_KHZ800);
  #else
    Adafruit_NeoPixel pixels(LEDS_COUNT, LED_GPIO, NEO_GRB + NEO_KHZ800);
  #endif
  #define CHANNEL 0
  #define LED_BRIGHT 30
  /*
  static const crgb_t L_RED = 0xff0000;
  static const crgb_t L_GREEN = 0x00ff00;
  static const crgb_t L_BLUE = 0x0000ff;
  static const crgb_t L_WHITE = 0xe0e0e0;
  static const crgb_t L_YELLOW = 0xffde21;
  static const crgb_t L_ORANGE = 0xffa500;
  static const crgb_t L_CYAN = 0x00ffff;
  static const crgb_t L_PURPLE = 0x800080;
  */
#endif

#ifdef USING_BUZZER
  #include "Buzzer.h"
#endif
#include <cstring>


/**********************************************************************************************/
/*                                                                                            */
/*                         profiler setup                                                     */
/*                                                                                            */
/**********************************************************************************************/
#include "FunctionProfiler.h"





/**********************************************************************************************/
/*                                                                                            */
/*                         loadcell reading                                                   */
/*                                                                                            */
/**********************************************************************************************/
float loadcellReading_global_fl32 = 0.0f;
void IRAM_ATTR loadcellReadingTask( void * pvParameters )
{
  for(;;){

    if (loadcell != NULL)
    {
      // no need for delay, since getReadingKg will block until DRDY edge down is detected
      float loadcellReading = loadcell->getReadingKg();
      
      if(semaphore_updateLoadcellReading != NULL)
      {
        if(xSemaphoreTake(semaphore_updateLoadcellReading, (TickType_t)1)==pdTRUE) {
          loadcellReading_global_fl32 = loadcellReading;
          xSemaphoreGive(semaphore_updateLoadcellReading);
        }
      }
      else
      {
        semaphore_updateLoadcellReading = xSemaphoreCreateMutex();
      }
    }
  }
}


/**********************************************************************************************/
/*                                                                                            */
/*                         pedal update                                                       */
/*                                                                                            */
/**********************************************************************************************/
#define REPETITION_INTERVAL_PEDAL_UPDATE_TASK_IN_US (int64_t)300

/**********************************************************************************************/
/*                                                                                            */
/*                         joystick update                                                    */
/*                                                                                            */
/**********************************************************************************************/
#define REPETITION_INTERVAL_JOYSTICKOUTPUT_TASK_IN_US (int64_t)10000

/**********************************************************************************************/
/*                                                                                            */
/*                         serial communication                                               */
/*                                                                                            */
/**********************************************************************************************/
#define REPETITION_INTERVAL_SERIALCOMMUNICATION_TASK_IN_US (int64_t)10000
#define REPETITION_INTERVAL_SERIALCOMMUNICATION_TASK_FAST_IN_US (int64_t)200


#define REPETITION_INTERVAL_ESPNOW_TASK_IN_US (int64_t)2000
#define REPETITION_INTERVAL_OTA_TASK_IN_US (int64_t)3000



// === Scheduler config ===
#define BASE_TICK_US 100   // base tick in microseconds
#define MAX_TASKS    10     // maximum tasks in scheduler

