Xanglu/DIY-Sim-Racing-FFB-Pedal-Odrive/ESP32/src/Main.cpp
// Task entry struct
typedef struct {
  TaskHandle_t handle;
  const char *name;
  TaskFunction_t fn;
  uint16_t intervalTicks;
  uint16_t counter;
  uint32_t lastKick;   // last time task ran (micros)
  UBaseType_t priority;
  BaseType_t core;
} SchedTask;

// Task table
SchedTask tasks[MAX_TASKS];
uint8_t taskCount = 0;

// Timer handle
hw_timer_t *timer0 = NULL;

// === Scheduler ISR ===
void IRAM_ATTR onTimer(void* arg) {
  BaseType_t xHigherPriorityWoken = pdFALSE;

  for (int i = 0; i < taskCount; i++) {
    tasks[i].counter++;
    if (tasks[i].counter >= tasks[i].intervalTicks) {
      tasks[i].counter = 0;
      if(NULL != tasks[i].handle)
      {
        vTaskNotifyGiveFromISR(tasks[i].handle, &xHigherPriorityWoken);
      }
      
    }
  }

  // Yield if a higher-priority task was woken.
  if (xHigherPriorityWoken) {
    portYIELD_FROM_ISR();
  }
}

// === Scheduler API ===
void addScheduledTask(TaskFunction_t fn, const char *name, uint16_t intervalUs,
                      UBaseType_t priority, BaseType_t core, uint32_t stackSize = 2048u) {
  if (taskCount >= MAX_TASKS) return;  // limit reached

  uint16_t intervalTicks = intervalUs / BASE_TICK_US;
  if (intervalTicks == 0) intervalTicks = 1;  // minimum 1 tick

  // Create task
  xTaskCreatePinnedToCore(fn, name, stackSize, NULL, priority,
                          &tasks[taskCount].handle, core);

  tasks[taskCount].intervalTicks = intervalTicks;
  tasks[taskCount].counter = 0;
  taskCount++;
}




TaskHandle_t handle_pedalUpdateTask = NULL;
TaskHandle_t handle_joystickOutput = NULL;
TaskHandle_t handle_loadcellReadingTask = NULL;
TaskHandle_t handle_serialCommunication = NULL; 
TaskHandle_t handle_miscTask = NULL; 
TaskHandle_t handle_otaTask = NULL;
TaskHandle_t handle_espnowTask = NULL;

#define COUNTER_SIZE 4u
uint16_t tickCount_au16[COUNTER_SIZE] = {0};


static uint16_t timerTicks_espNowTask_u16 = REPETITION_INTERVAL_ESPNOW_TASK_IN_US / BASE_TICK_US;




/**********************************************************************************************/
/*                                                                                            */
/*                         setup function                                                     */
/*                                                                                            */
/**********************************************************************************************/
#include "driver/uart.h"


// Queue to handle UART events
static QueueHandle_t uart_queue;

#define UART_RX_BUF_SIZE   1024


/**
 * @brief Task to handle UART events.
 *
 * This task waits for a UART_PATTERN_DET event, which is triggered
 * by the hardware when the PACKET_EOF_CHAR is detected.
 */
static void uart_event_task(void *pvParameters) {
  uart_event_t event;
  uint8_t* dtmp = (uint8_t*) malloc(UART_RX_BUF_SIZE);

  for (;;) {
    delay(100);
    // Wait for the next event from the UART driver
    if (xQueueReceive(uart_queue, (void * )&event, (TickType_t)portMAX_DELAY)) {
      
      Serial.println("pattern detected");

      switch (event.type) {
        
        // --- MODIFIED: The primary event we now listen for ---
        // Event triggered when the hardware detects our pattern (EOF character)
        case UART_PATTERN_DET:
          {
            // Get the size of the data available in the buffer
            size_t buffered_size;
            uart_get_buffered_data_len(UART_NUM_0, &buffered_size);
            
            // Read the complete packet from the UART buffer
            int pos = uart_read_bytes(UART_NUM_0, dtmp, buffered_size, pdMS_TO_TICKS(100));
            
            // Ensure we have at least two bytes and they match the EOF pattern.
            if (pos >= 2 && dtmp[pos - 2] == EOF_BYTE_0 && dtmp[pos - 1] == EOF_BYTE_1) {
              // Null-terminate the received data to treat it as a string
              dtmp[pos] = '\0';

              // Print a header to the main Serial Monitor for clarity
              Serial.printf("\n[UART PATTERN DETECTED - COMPLETE PACKET (%d bytes)]\n", pos);

              // Write the received packet to the main Serial Monitor
              Serial.printf("Packet Data: \"%s\"\n", (char*)dtmp);
              
              // --- YOUR PACKET PROCESSING LOGIC GOES HERE ---
              // You can now safely parse the complete packet in `dtmp`
            }
          }
          break;

        // Event for a FIFO buffer overflow
        case UART_FIFO_OVF:
          Serial.println("Hardware FIFO overflow");
          uart_flush_input(UART_NUM_0);
          xQueueReset(uart_queue);
          break;

        // Event for a ring buffer full condition
        case UART_BUFFER_FULL:
          Serial.println("Ring buffer full");
          uart_flush_input(UART_NUM_0);
          xQueueReset(uart_queue);
          break;

        // Other unhandled events (like UART_DATA) are now ignored but
        // can be handled here if needed for timeouts or error recovery.
        default:
          // Flushing the buffer on unexpected events can help prevent lock-ups
          uart_flush_input(UART_NUM_0);
          break;
      }
    }
  }
  // Free the temporary buffer and delete the task if the loop ever exits
  free(dtmp);
  dtmp = NULL;
  vTaskDelete(NULL);
}



void setup()
{

  

  

  DAP_config_st dap_config_st_local;

// setup brake resistor pin
#ifdef BRAKE_RESISTOR_PIN
  pinMode(BRAKE_RESISTOR_PIN, OUTPUT);  // Set GPIO13 as an output
  digitalWrite(BRAKE_RESISTOR_PIN, LOW);  // Turn the LED on
#endif

#ifdef EMERGENCY_PIN
  pinMode(EMERGENCY_PIN,INPUT_PULLUP);
#endif

#ifdef ANGLE_SENSOR_GPIO

  pinMode(ANGLE_SENSOR_GPIO, INPUT);
  pinMode(ANGLE_SENSOR_GPIO_2, INPUT);
#endif



  //Serial.begin(115200);
  //Serial.begin(921600);
  //Serial.begin(512000);
  //
  #ifdef USING_LED
    pixels.begin();
    pixels.setBrightness(20);
    pixels.setPixelColor(0,0xff,0xff,0xff);
    pixels.show(); 
  #endif
  
  #ifdef USING_BUZZER
    Buzzer.initialized(BuzzerPin,1);
    Buzzer.single_beep_tone(770,100);
  #endif

  #if PCB_VERSION == 7
    Serial.setTxTimeoutMs(0);
    Serial.begin(DEFAULTBAUD);
  #else
    #ifdef BAUDRATE3M
      Serial.begin(BAUD3M, SERIAL_8N1);
      Serial.setTxBufferSize(256);
    #else
      Serial.begin(DEFAULTBAUD, SERIAL_8N1);
    #endif
    Serial.setTimeout(5);
  #endif
  parse_version(DAP_FIRMWARE_VERSION, &versionMajor, &versionMinor, &versionPatch);
  Serial.println(" ");
  Serial.println(" ");
  Serial.println(" ");
  //delay(3000);
  Serial.println("This work is licensed under a Creative Commons Attribution-NonCommercial-ShareAlike 4.0 International License.");
  Serial.println("Please check github repo for more detail: https://github.com/ChrGri/DIY-Sim-Racing-FFB-Pedal");
  //printout the github releasing version
  //#ifdef OTA_update
  Serial.print("Board: ");
  Serial.println(CONTROL_BOARD);
  Serial.print("Firmware Version:");
  Serial.println(DAP_FIRMWARE_VERSION);
  //#endif

  
	#ifdef Hardware_Pairing_button
    pinMode(Pairing_GPIO, INPUT_PULLUP);
  #endif

