Xanglu/DIY-Sim-Racing-FFB-Pedal-Odrive/ESP32/src/Main.cpp
  Serial.println("Setup end");
  #ifdef USING_LED
      //pixels.setBrightness(20);
      pixels.setPixelColor(0,0x00,0xff,0x00);//Green
      pixels.show(); 
      //delay(3000);
  #endif

  #ifdef USING_BUZZER
    if(dap_config_st_local.payLoadPedalConfig_.pedal_type==0)
    {
      delay(500);
      Buzzer.single_beep_ledc_fade(NOTE_D4,3072,1);
      //Buzzer.single_beep_ledc_fade(NOTE_A4,1536,0.5);
    }
    if(dap_config_st_local.payLoadPedalConfig_.pedal_type==1)
    {
      Buzzer.single_beep_ledc_fade(NOTE_A4,3072,1);
    }    
    if(dap_config_st_local.payLoadPedalConfig_.pedal_type==2)
    {
      delay(500);
      //Buzzer.single_beep_ledc_fade(NOTE_A4,1536,0.5);
      Buzzer.single_beep_ledc_fade(NOTE_D4,3072,1);
    }    
    //Buzzer.single_beep_tone(440,1500);
  #endif
}




/**********************************************************************************************/
/*                                                                                            */
/*                         Calc update function                                               */
/*                                                                                            */
/**********************************************************************************************/
void updatePedalCalcParameters()
{

  DAP_config_st dap_config_st_local = global_dap_config_class.getConfig();

  dap_calculationVariables_st.updateFromConfig(dap_config_st_local);
  dap_calculationVariables_st.updateEndstops(stepper->getLimitMin(), stepper->getLimitMax());
  stepper->updatePedalMinMaxPos(dap_config_st_local.payLoadPedalConfig_.pedalStartPosition, dap_config_st_local.payLoadPedalConfig_.pedalEndPosition);
  dap_calculationVariables_st.updateStiffness();

  // tune the PID settings
  tunePidValues(dap_config_st_local);
}



/**********************************************************************************************/
/*                                                                                            */
/*                         Main function                                                      */
/*                                                                                            */
/**********************************************************************************************/
void loop() {
  vTaskDelete(NULL);  // Kill the Arduino loop task
}




/**********************************************************************************************/
/*                                                                                            */
/*                         pedal update task                                                  */
/*                                                                                            */
/**********************************************************************************************/
void IRAM_ATTR pedalUpdateTask( void * pvParameters )
{

  static DRAM_ATTR DAP_state_extended_st dap_state_extended_st_lcl_pedalUpdateTask;
  FunctionProfiler profiler_pedalUpdateTask;
  profiler_pedalUpdateTask.setName("PedalUpdate");
  float loadcellReading = 0.0f;
  float filteredReading_exp_filter = 0;
  unsigned long servoActionLast = millis();
  bool firstReadConfig=true;
  unsigned long debugMessageLast=0;

  uint32_t pos_printCount = 0;
  uint32_t controlTask_stackSizeIdx_u32 = 0;
  float previousLoadcellReadingInKg_fl32 = 0.0f;
 
  for(;;){

    // wait for the timer to fire
    // This will block until the timer callback gives the semaphore. It won't consume CPU time while waiting.
    // if(handle_pedalUpdateTask != NULL)
    {
      if (ulTaskNotifyTake(pdTRUE, portMAX_DELAY) > 0) {

        // copy global struct to local for faster and safe executiion
        DAP_config_st dap_config_pedalUpdateTask_st = global_dap_config_class.getConfig();

        // activate profiler depending on pedal config
        if (dap_config_pedalUpdateTask_st.payLoadPedalConfig_.debug_flags_0 & DEBUG_INFO_0_CYCLE_TIMER) 
        {
          profiler_pedalUpdateTask.activate( true );
        }
        else
        {
          profiler_pedalUpdateTask.activate( false );
        }


        // start profiler 0, overall function
        profiler_pedalUpdateTask.start(0);
        
        

        // system identification mode
        #ifdef ALLOW_SYSTEM_IDENTIFICATION
          if (systemIdentificationMode_b == true)
          {
            measureStepResponse(stepper, &dap_calculationVariables_st, &dap_config_pedalUpdateTask_st, loadcell);
            systemIdentificationMode_b = false;
          }
        #endif
      

        // if a config update was received over serial, update the variables required for further computation
        if (configUpdateAvailable == true)
        {
            bool configWasUpdated_b = false;
            // Take the semaphore and just update the config file, then release the semaphore
            
            Serial.println("Updating pedal config");
            configUpdateAvailable = false;

            // update the calc params
            Serial.println("Updating the calc params");
            configWasUpdated_b = false;
            //Serial.print("save to eeprom tag:");
            //Serial.println(dap_config_pedalUpdateTask_st.payLoadHeader_.storeToEeprom);
            if(firstReadConfig)
            {
              firstReadConfig=false;
            }
            else
            {
              previewConfigGet_b = true;
              saveToEEPRomDuration = millis();
            }
            
            if (true == dap_config_pedalUpdateTask_st.payLoadHeader_.storeToEeprom)
            {
              dap_config_pedalUpdateTask_st.payLoadHeader_.storeToEeprom = false; // set to false, thus at restart existing EEPROM config isn't restored to EEPROM
              uint16_t crc = checksumCalculator((uint8_t*)(&(dap_config_pedalUpdateTask_st.payLoadHeader_)), sizeof(dap_config_pedalUpdateTask_st.payLoadHeader_) + sizeof(dap_config_pedalUpdateTask_st.payLoadPedalConfig_));
              dap_config_pedalUpdateTask_st.payloadFooter_.checkSum = crc;

