Xanglu/DIY-Sim-Racing-FFB-Pedal-Odrive/ESP32/src/Main.cpp
              global_dap_config_class.storeConfigToEprom();
              previewConfigGet_b = false;
              saveToEEPRomDuration = 0;
            }
            
            updatePedalCalcParameters(); // update the calc parameters
            moveSlowlyToPosition_b = true;
        }
        
        //#define RECALIBRATE_POSITION
        #ifdef RECALIBRATE_POSITION
          stepper->checkLimitsAndResetIfNecessary();
        #endif


        // start profiler 1, effects
        profiler_pedalUpdateTask.start(1);


        // compute pedal oscillation, when ABS is active
        float absForceOffset = 0.0f;
        float absPosOffset = 0.0f;
        dap_calculationVariables_st.Default_pos();
        #ifdef ABS_OSCILLATION
          absOscillation.forceOffset(&dap_calculationVariables_st, dap_config_pedalUpdateTask_st.payLoadPedalConfig_.absPattern, dap_config_pedalUpdateTask_st.payLoadPedalConfig_.absForceOrTarvelBit, &absForceOffset, &absPosOffset);
          _RPMOscillation.trigger();
          _RPMOscillation.forceOffset(&dap_calculationVariables_st);
          _BitePointOscillation.forceOffset(&dap_calculationVariables_st);
          _G_force_effect.forceOffset(&dap_calculationVariables_st, dap_config_pedalUpdateTask_st.payLoadPedalConfig_.G_multi);
          _WSOscillation.forceOffset(&dap_calculationVariables_st);
          _Road_impact_effect.forceOffset(&dap_calculationVariables_st, dap_config_pedalUpdateTask_st.payLoadPedalConfig_.Road_multi);
          CV1.forceOffset(dap_config_pedalUpdateTask_st.payLoadPedalConfig_.CV_freq_1,dap_config_pedalUpdateTask_st.payLoadPedalConfig_.CV_amp_1);
          CV2.forceOffset(dap_config_pedalUpdateTask_st.payLoadPedalConfig_.CV_freq_2,dap_config_pedalUpdateTask_st.payLoadPedalConfig_.CV_amp_2);
          if(dap_calculationVariables_st.Rudder_status) 
          {
            _rudder.offset_calculate(&dap_calculationVariables_st);
            dap_calculationVariables_st.update_stepperMinpos(_rudder.offset_filter);
            _rudder_g_force.offset_calculate(&dap_calculationVariables_st);
            dap_calculationVariables_st.update_stepperMaxpos(_rudder_g_force.offset_filter);
          }
          if(dap_calculationVariables_st.helicopterRudderStatus) 
          {
            helicopterRudder_.offset_calculate(&dap_calculationVariables_st);
            dap_calculationVariables_st.update_stepperMinpos(helicopterRudder_.offset_filter);
          }
          #ifdef ESPNow_debug_rudder
            if(millis()-debugMessageLast>500)
            {
              debugMessageLast=millis();
              Serial.print("Center offset:");
              Serial.println(_rudder.offset_filter);
              Serial.print("min default:");
              Serial.println(dap_calculationVariables_st.stepperPosMin_default);
            }
          #endif

          //_rudder.force_offset_calculate(&dap_calculationVariables_st);

        #endif

        //update max force with G force effect
        movingAverageFilter.dataPointsCount = dap_config_pedalUpdateTask_st.payLoadPedalConfig_.G_window;
        movingAverageFilter_roadimpact.dataPointsCount = dap_config_pedalUpdateTask_st.payLoadPedalConfig_.Road_window;
        dap_calculationVariables_st.reset_maxforce();
        dap_calculationVariables_st.Force_Max += _G_force_effect.G_force;
        dap_calculationVariables_st.Force_Max += _Road_impact_effect.Road_Impact_force;
        dap_calculationVariables_st.dynamic_update();
        dap_calculationVariables_st.updateStiffness();
      
        // end profiler 1, effects
        profiler_pedalUpdateTask.end(1);

        // start profiler 2, loadcell reading
        profiler_pedalUpdateTask.start(2);

        // Get the loadcell reading
        if(semaphore_updateLoadcellReading != NULL)
        {
          if(xSemaphoreTake(semaphore_updateLoadcellReading, (TickType_t)0)==pdTRUE) {
            loadcellReading = loadcellReading_global_fl32;
            xSemaphoreGive(semaphore_updateLoadcellReading);
          }
        }




        // end profiler 2, loadcell reading
        profiler_pedalUpdateTask.end(2);

        // detect loadcell outlier
        float loadcellDifferenceToLastCycle_fl32 = loadcellReading - previousLoadcellReadingInKg_fl32;
        previousLoadcellReadingInKg_fl32 = loadcellReading;
        if(!dap_calculationVariables_st.Rudder_status && !dap_calculationVariables_st.helicopterRudderStatus)
        {
          //make the force reading skip only in pedal mode
          if (fabsf(loadcellDifferenceToLastCycle_fl32) > 5.0f)
          {
            dap_calculationVariables_st.StepperPos_setback();
            dap_calculationVariables_st.reset_maxforce();
            dap_calculationVariables_st.dynamic_update();
            dap_calculationVariables_st.updateStiffness();
            // reject update when loadcell reading likely outlier
            continue;
          }
        }

        



        uint16_t angleReading_ui16 = 0;
    #ifdef ANGLE_SENSOR_GPIO
          angleReading_ui16 = analogRead(ANGLE_SENSOR_GPIO);
          // if (pos_printCount >= 100)
          // {
          //   Serial.printf("Ang.: %f\n", angleReading_ui16);
          //   pos_printCount = 0;
          // }
          // pos_printCount++;
    #endif

        // Get the angle measurement reading
        // float angleReading = loadcell->getAngleMeasurement();

        
        // if (pos_printCount >= 100)
        // {
        //   Serial.printf("Ang.: %f\n", angleReading);
        //   pos_printCount = 0;
        // }
        // pos_printCount++;
      

        // start profiler 3, loadcell reading conversion
        profiler_pedalUpdateTask.start(3);

        // Invert the loadcell reading digitally if desired
        if (dap_config_pedalUpdateTask_st.payLoadPedalConfig_.invertLoadcellReading_u8 == 1)
        {
          loadcellReading *= -1.0f;
        }

        // Convert loadcell reading to pedal force
        float sledPosition = sledPositionInMM(stepper, &dap_config_pedalUpdateTask_st, motorRevolutionsPerSteps_fl32);
        float pedalInclineAngleInDeg_fl32 = pedalInclineAngleDeg(sledPosition, &dap_config_pedalUpdateTask_st);
        float pedalForce_fl32 = convertToPedalForce(loadcellReading, sledPosition, &dap_config_pedalUpdateTask_st);
        float d_phi_d_x = convertToPedalForceGain(sledPosition, &dap_config_pedalUpdateTask_st);

