Xanglu/DIY-Sim-Racing-FFB-Pedal-Odrive/ESP32/src/Main.cpp
        // print profiler results
        profiler_pedalUpdateTask.report();
      
      }
    }

  }
}

  






/**********************************************************************************************/
/*                                                                                            */
/*                         joystick output task                                               */
/*                                                                                            */
/**********************************************************************************************/
void IRAM_ATTR joystickOutputTask( void * pvParameters )
{ 
  int32_t joystickNormalizedToInt32_local = 0;

  FunctionProfiler profiler_joystickOutputTask;
  profiler_joystickOutputTask.setName("JoystickOutput");
  profiler_joystickOutputTask.setNumberOfCalls(500);


  for(;;){

    // wait for the timer to fire
    // This will block until the timer callback gives the semaphore. It won't consume CPU time while waiting.
    // if(handle_joystickOutput != NULL)
    {
      if (ulTaskNotifyTake(pdTRUE, portMAX_DELAY) > 0) {

        // copy global struct to local for faster and safe executiion
        DAP_config_st jut_dap_config_st = global_dap_config_class.getConfig();

        // activate profiler depending on pedal config
        if (jut_dap_config_st.payLoadPedalConfig_.debug_flags_0 & DEBUG_INFO_0_CYCLE_TIMER) 
        {
          profiler_joystickOutputTask.activate( true );
        }
        else
        {
          profiler_joystickOutputTask.activate( false );
        }

        // start profiler 0, overall function
        profiler_joystickOutputTask.start(0);


        // obtain joystick output level
        if(semaphore_updateJoystick!=NULL)
        {
          if(xSemaphoreTake(semaphore_updateJoystick, (TickType_t)1)==pdTRUE)
          {
            //Serial.print(" 3");
            joystickNormalizedToInt32_local = joystickNormalizedToInt32;
            xSemaphoreGive(semaphore_updateJoystick);
          }
        }


        // send joystick output
        #if defined(USB_JOYSTICK) || defined(BLUETOOTH_GAMEPAD)
          if (IsControllerReady()) 
          {
            if(dap_calculationVariables_st.Rudder_status==false)
            {
              //general output
              SetControllerOutputValue(joystickNormalizedToInt32_local);
              
              #ifdef USB_JOYSTICK
                // Restart HID output if faulty behavior was detected
                JoystickSendState();
                if(!GetJoystickStatus())
                {
                  RestartJoystick();
                  Serial.println("HID Error, Restart Joystick...");
                  //last_serial_joy_out=millis();
                }
              #endif

            }
          }
        #endif


        // start profiler 0, overall function
        profiler_joystickOutputTask.end(0);

        profiler_joystickOutputTask.end(0);

        // print profiler results
        profiler_joystickOutputTask.report();

      }
    }
  }
}

/**********************************************************************************************/
/*                                                                                            */
/*                         communication task                                                 */
/*                                                                                            */
/**********************************************************************************************/
uint32_t communicationTask_stackSizeIdx_u32 = 0;
void IRAM_ATTR serialCommunicationTask( void * pvParameters )
{ 
  int32_t joystickNormalizedToInt32_local = 0;
  FunctionProfiler profiler_serialCommunicationTask;
  profiler_serialCommunicationTask.setName("SerialCommunication");
  profiler_serialCommunicationTask.setNumberOfCalls(500);

  unsigned long previousTimeInUsFromExtendedStruct_u32 = 0;
  unsigned long printCycleCounter = 0;

  static uint16_t timerTicks_serialCommunicationTask_u16 = REPETITION_INTERVAL_SERIALCOMMUNICATION_TASK_IN_US / BASE_TICK_US;
  static uint16_t timerTicks_serialCommunicationTask_prev_u16 = timerTicks_serialCommunicationTask_u16;

  static DAP_config_st sct_dap_config_received_st;
  static DAP_config_st sct_dap_config_st;
  for(;;){

    sct_dap_config_st = global_dap_config_class.getConfig();

    // when debug flag == DEBUG_INFO_0_STATE_EXTENDED_INFO_STRUCT is set --> change the serial communication task time
    if ( (sct_dap_config_st.payLoadPedalConfig_.debug_flags_0 & DEBUG_INFO_0_STATE_EXTENDED_INFO_STRUCT) )
    {
      // fast execution
      timerTicks_serialCommunicationTask_u16 = REPETITION_INTERVAL_SERIALCOMMUNICATION_TASK_FAST_IN_US / BASE_TICK_US;
    }
    else
    {
      // slow execution
      timerTicks_serialCommunicationTask_u16 = REPETITION_INTERVAL_SERIALCOMMUNICATION_TASK_IN_US / BASE_TICK_US;   
    }


    // check if timer intervall needs to change
    if (timerTicks_serialCommunicationTask_prev_u16 != timerTicks_serialCommunicationTask_u16)
    {
      // // search for task and update interval
      // for (int i = 0; i < taskCount; i++) {

      //   // if (tasks[i].name == String("serialCommunicationTask")) {
      //   if (tasks[i].name && strcmp(tasks[i].name, "serialCommunicationTask") == 0) {

      //       // update previous value
      //       timerTicks_serialCommunicationTask_prev_u16 = timerTicks_serialCommunicationTask_u16;

      //       Serial.print("Setting serial communication task to: ");
      //       Serial.print(timerTicks_serialCommunicationTask_u16 * BASE_TICK_US);
      //       Serial.println("us");

      //       tasks[i].intervalTicks = timerTicks_serialCommunicationTask_u16;
      //       tasks[i].counter = 0;  // reset counter
      //       break;
      //   }
      // }


      // update previous value
      timerTicks_serialCommunicationTask_prev_u16 = timerTicks_serialCommunicationTask_u16;

      Serial.print("Setting serial communication task to: ");
      Serial.print(timerTicks_serialCommunicationTask_u16 * BASE_TICK_US);
      Serial.println("us");

      
