Xanglu/DIY-Sim-Racing-FFB-Pedal-Odrive/ESP32/src/Main.cpp
      tasks[1].intervalTicks = timerTicks_serialCommunicationTask_u16;
      tasks[1].counter = 0;  // reset counter

    }

    



    // wait for the timer to fire
    // This will block until the timer callback gives the semaphore. It won't consume CPU time while waiting.
    // if(handle_serialCommunication != NULL)
    {
      if (ulTaskNotifyTake(pdTRUE, portMAX_DELAY) > 0) {

        // activate profiler depending on pedal config
        if (sct_dap_config_st.payLoadPedalConfig_.debug_flags_0 & DEBUG_INFO_0_CYCLE_TIMER) 
        {
          profiler_serialCommunicationTask.activate( true );
        }
        else
        {
          profiler_serialCommunicationTask.activate( false );
        }


        // start profiler 0, overall function
        profiler_serialCommunicationTask.start(0);

        // start profiler 1, serial read
        profiler_serialCommunicationTask.start(1);


        uint16_t crc;

      
        { 
          // read serial input 
          uint8_t n = Serial.available();

          bool structChecker = true;
          
          if (n > 0)
          {
            switch (n) {

              // likely config structure 
              case sizeof(DAP_config_st):

                DAP_config_st * dap_config_st_local_ptr;
                dap_config_st_local_ptr = &sct_dap_config_received_st;
                Serial.readBytes((char*)dap_config_st_local_ptr, sizeof(DAP_config_st));

                // check if data is plausible
                if ( sct_dap_config_received_st.payLoadHeader_.payloadType != DAP_PAYLOAD_TYPE_CONFIG ){ 
                  structChecker = false;
                  Serial.print("Payload type expected: ");
                  Serial.print(DAP_PAYLOAD_TYPE_CONFIG);
                  Serial.print(",   Payload type received: ");
                  Serial.println(sct_dap_config_received_st.payLoadHeader_.payloadType);
                  break; // Exit case early
                }

                if ( sct_dap_config_received_st.payLoadHeader_.version != DAP_VERSION_CONFIG ){ 
                  structChecker = false;
                  Serial.print("Config version expected: ");
                  Serial.print(DAP_VERSION_CONFIG);
                  Serial.print(",   Config version received: ");
                  Serial.println(sct_dap_config_received_st.payLoadHeader_.version);
                  break; // Exit case early
                }
                // checksum validation
                crc = checksumCalculator((uint8_t*)(&(sct_dap_config_received_st.payLoadHeader_)), sizeof(sct_dap_config_received_st.payLoadHeader_) + sizeof(sct_dap_config_received_st.payLoadPedalConfig_));
                if (crc != sct_dap_config_received_st.payloadFooter_.checkSum){ 
                  structChecker = false;
                  Serial.print("CRC expected: ");
                  Serial.print(crc);
                  Serial.print(",   CRC received: ");
                  Serial.println(sct_dap_config_received_st.payloadFooter_.checkSum);
                  
                  // No need to break here, as it's the last check before the final 'if'
                  Serial.print("Headersize: ");
                  Serial.print(sizeof(sct_dap_config_received_st.payLoadHeader_));
                  Serial.print(",    Configsize: ");
                  Serial.println(sizeof(sct_dap_config_received_st.payLoadPedalConfig_));
                }


                // if checks are successfull, overwrite global configuration struct
                if (structChecker == true)
                {
                  Serial.println("Updating pedal config");

                  global_dap_config_class.setConfig(sct_dap_config_received_st);
                  sct_dap_config_st = global_dap_config_class.getConfig();
                  configUpdateAvailable = true; 

                  #ifdef USING_BUZZER
                    if(sct_dap_config_st.payLoadHeader_.storeToEeprom==1)
                    {
                      Buzzer.single_beep_tone(700,100);
                    }     
                  #endif        
                }
                break;

              // likely action structure 
              case sizeof(DAP_actions_st) :

                DAP_actions_st dap_actions_st;
                Serial.readBytes((char*)&dap_actions_st, sizeof(DAP_actions_st));

                if ( dap_actions_st.payLoadHeader_.payloadType != DAP_PAYLOAD_TYPE_ACTION ){ 
                  structChecker = false;
                  Serial.print("Payload type expected: ");
                  Serial.print(DAP_PAYLOAD_TYPE_ACTION);
                  Serial.print(",   Payload type received: ");
                  Serial.println(dap_actions_st.payLoadHeader_.payloadType);
                }
                if ( dap_actions_st.payLoadHeader_.version != DAP_VERSION_CONFIG ){ 
                  structChecker = false;
                  Serial.print("Config version expected: ");
                  Serial.print(DAP_VERSION_CONFIG);
                  Serial.print(",   Config version received: ");
                  Serial.println(dap_actions_st.payLoadHeader_.version);
                }
                crc = checksumCalculator((uint8_t*)(&(dap_actions_st.payLoadHeader_)), sizeof(dap_actions_st.payLoadHeader_) + sizeof(dap_actions_st.payloadPedalAction_));
                if (crc != dap_actions_st.payloadFooter_.checkSum){ 
                  structChecker = false;
                  Serial.print("CRC expected: ");
                  Serial.print(crc);
                  Serial.print(",   CRC received: ");
                  Serial.println(dap_actions_st.payloadFooter_.checkSum);
                }



                if (structChecker == true)
                {

                  //2= restart pedal
                  if (dap_actions_st.payloadPedalAction_.system_action_u8==2)
                  {
                    Serial.println("ESP restart by user request");
                    ESP.restart();
                  }
                  //3= Wifi OTA
                  #ifdef ESPNOW_Enable
                  if (dap_actions_st.payloadPedalAction_.system_action_u8==3)
                  {
                    Serial.println("Get OTA command");
                    OTA_enable_b=true;
                    //OTA_enable_start=true;
                    ESPNow_OTA_enable=false;
                  }
                  #endif
                  //4 Enable pairing
                  if (dap_actions_st.payloadPedalAction_.system_action_u8==4)
                  {
                    #ifdef ESPNow_Pairing_function
                      Serial.println("Get Pairing command");
                      software_pairing_action_b=true;
                    #endif
                    #ifndef ESPNow_Pairing_function
                      Serial.println("no supporting command");
                    #endif
                  }
                  
                  if (dap_actions_st.payloadPedalAction_.system_action_u8==(uint8_t)PedalSystemAction::ESP_BOOT_INTO_DOWNLOAD_MODE)
                  {
                    #ifdef ESPNow_S3
                      Serial.println("Restart into Download mode");
                      delay(1000);
                      REG_WRITE(RTC_CNTL_OPTION1_REG, RTC_CNTL_FORCE_DOWNLOAD_BOOT);
                      ESP.restart();
                    #else
                      Serial.println("Command not supported");
                      delay(1000);
                    #endif
                    //ESPNOW_BootIntoDownloadMode = false;
                  }
                  if (dap_actions_st.payloadPedalAction_.system_action_u8 == (uint8_t)PedalSystemAction::PRINT_PEDAL_INFO)
                  {
                    char logString[200];
                    snprintf(logString, sizeof(logString),
                            "Pedal ID: %d\nBoard: %s\nLoadcell shift= %.3f kg\nLoadcell variance= %.3f kg\nPSU voltage:%.1f V\nMax endstop:%lu\nCurrentPos:%lu\n\0",
                            sct_dap_config_st.payLoadPedalConfig_.pedal_type, CONTROL_BOARD, loadcell->getShiftingEstimate(), loadcell->getSTDEstimate(), ((float)stepper->getServosVoltage() / 10.0f), dap_calculationVariables_st.stepperPosMaxEndstop, dap_calculationVariables_st.current_pedal_position);
                    Serial.println(logString);
                  }

                  // trigger ABS effect
                  if (dap_actions_st.payloadPedalAction_.triggerAbs_u8>0)
                  {
                    absOscillation.trigger();
                    if(dap_actions_st.payloadPedalAction_.triggerAbs_u8>1)
                    {
                      dap_calculationVariables_st.TrackCondition=dap_actions_st.payloadPedalAction_.triggerAbs_u8-1;
                    }
                    else
                    {
                      dap_calculationVariables_st.TrackCondition=dap_actions_st.payloadPedalAction_.triggerAbs_u8=0;
                    }
                  }
                  //RPM effect
                  _RPMOscillation.RPM_value=dap_actions_st.payloadPedalAction_.RPM_u8;
                  //G force effect
                  _G_force_effect.G_value=dap_actions_st.payloadPedalAction_.G_value-128;       
                  //wheel slip
                  if (dap_actions_st.payloadPedalAction_.WS_u8)
                  {
                    _WSOscillation.trigger();
                  }     
                  //Road impact
                  if(dap_calculationVariables_st.Rudder_status==false)
                  {
                    _Road_impact_effect.Road_Impact_value=dap_actions_st.payloadPedalAction_.impact_value_u8;
                  }
                  else
                  {

