Xanglu/DIY-Sim-Racing-FFB-Pedal-Odrive/ESP32/src/Main.cpp
          } 
              
                  
        #endif



        
          #ifdef PRINT_TASK_FREE_STACKSIZE_IN_WORDS
            if( espNowTask_stackSizeIdx_u32 == 1000)
            {
              UBaseType_t stackHighWaterMark = uxTaskGetStackHighWaterMark(NULL);
              Serial.print("StackSize (ESP-Now): ");
              Serial.println(stackHighWaterMark);
              espNowTask_stackSizeIdx_u32 = 0;
            }
            espNowTask_stackSizeIdx_u32++;
          #endif
      }

      profiler_espNow.end(0);

      // print profiler results
      profiler_espNow.report();

    }
  

}
#endif

#define CONFIG_PREVIEW_DURATION 180000// wait 3 mins then save config into eeprom
void miscTask( void * pvParameters )
{
  // for the task no need complete asap, ex buzzer, led 
  for(;;)
  {
    DAP_config_st misc_dap_config_st = global_dap_config_class.getConfig();
    if(previewConfigGet_b && ((millis()-saveToEEPRomDuration)>CONFIG_PREVIEW_DURATION))
    {
      
      Serial.println("Auto save config in pedal");
      /*
      Serial.print(millis());
      Serial.print(" Duration:");
      Serial.print(saveToEEPRomDuration);
      Serial.print(" flag:");
      Serial.println(previewConfigGet_b);
      */
      //saveToEEPRomDuration=0;
      global_dap_config_class.storeConfigToEprom();
      previewConfigGet_b=false;
      #ifdef USING_BUZZER
        Buzzer.single_beep_tone(700,50);
        delay(50);
        Buzzer.single_beep_tone(700,50);
      #endif 


    }
    delay(100);
  }
}
